TexasInstruments/c2000ware-core-sdk/driverlib/f28p551x/driverlib/inc/hw_gpio.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the GPHTOGGLE register
//
//*************************************************************************************************
#define GPIO_GPHTOGGLE_GPIO224   0x1U          // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO225   0x2U          // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO226   0x4U          // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO227   0x8U          // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO228   0x10U         // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO229   0x20U         // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO230   0x40U         // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO231   0x80U         // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO232   0x100U        // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO233   0x200U        // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO234   0x400U        // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO235   0x800U        // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO236   0x1000U       // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO237   0x2000U       // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO238   0x4000U       // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO239   0x8000U       // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO240   0x10000U      // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO241   0x20000U      // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO242   0x40000U      // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO244   0x100000U     // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO245   0x200000U     // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO247   0x800000U     // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO248   0x1000000U    // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO249   0x2000000U    // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO251   0x8000000U    // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO252   0x10000000U   // Output Toggle bit for this pin
#define GPIO_GPHTOGGLE_GPIO253   0x20000000U   // Output Toggle bit for this pin




#endif
